ART-J/msp432p401r_nosdk_red/src/devicelib/ssd1351.c
/*
 * ssd1351.c
 *
 *  Created on: 2016-10-20
 *      Author: Jack Chen <redchenjs@live.com>
 *  Fixed on :  2020-02-04 22:14
 *      Author: art-j <jjw903427521@gmail.com>
 * 
 * --------SSD1351--------
 * PORT		TYPE	PIN
 * RES		OUT		P2.0
 * DC		OUT		P2.1
 * CS		OUT		P2.2
 * SCK		OUT		P1.5(SPI)
 * MOSI		OUT		P1.7(SPI)
 * -----------------------
 */

#include <inc/devicelib/ssd1351.h>
#include <inc/driverlib/usci_b3_spi.h>
#include <msp.h>

#include <inc/system/fonts.h>
//#include <inc/device/soft_spi.h>

#define abs(x) ((x)>0?(x):-(x))
#define min(a,b) ((a)<(b)?(a):(b))
#define max(a,b) ((a)>(b)?(a):(b))

#define SSD1351_PIN_SET()	P10DIR |= BIT3; P10DIR |= BIT4; P10DIR |= BIT5

#define SSD1351_RES_SET()	P10OUT |= BIT3
#define SSD1351_RES_CLR()	P10OUT &=~BIT3
#define SSD1351_DC_SET()	P10OUT |= BIT4
#define SSD1351_DC_CLR()	P10OUT &=~BIT4
#define SSD1351_CS_SET()	P10OUT |= BIT5
#define SSD1351_CS_CLR()	P10OUT &=~BIT5

#define SSD1351_WRITE_BYTE(__DATA)	usci_b3_spi_transmit_frame(&__DATA, 1)

enum ssd1351_panel_value {
    SSD1351_WIDTH  = 128,
    SSD1351_HEIGHT = 128
};

enum ssd1351_data_type {
    SSD1351_CMD  = 0,
    SSD1351_DATA = 1
};

enum ssd1351_fundamental_command_table {
    SET_COLUMN_ADDRESS  = 0x15,
    SET_ROW_ADDRESS     = 0x75,

    SET_WRITE_RAM       = 0x5C,
    SET_READ_RAM        = 0x5D,

    SET_REMAP_COLOR_DEPTH   = 0xA0,
    SET_DISPLAY_START_LINE  = 0xA1,
    SET_DISPLAY_OFFSET      = 0xA2,

    SET_ENTIRE_DISPLAY_OFF  = 0xA4,
    SET_ENTIRE_DISPLAY_ON   = 0xA5,
    SET_NORMAL_DISPLAY      = 0xA6,
    SET_INVERSE_DISPLAY     = 0xA7,

    SET_FUNCTION_SELECTION  = 0xAB,

    SET_SLEEP_MODE_ON       = 0xAE,
    SET_SLEEP_MODE_OFF      = 0xAF,

    SET_RESET_PRECHARGE_PERIOD      = 0xB1,
    SET_DISPLAY_ENHANCEMENT         = 0xB2,
    SET_FRONT_CLOCK_DIV_OSC_FREQ    = 0xB3,
    SET_SEGMENT_LOW_VOLTAGE         = 0xB4,
    SET_GPIO                        = 0xB5,
    SET_SECOND_PRECHARGE_PERIOD     = 0xB6,

    SET_GRAY_SCALE_TABLE    = 0xB8,
    SET_BUILTIN_LINEAR_LUT  = 0xB9,
    SET_PRECHARGE_VOLTAGE   = 0xBB,
    SET_VCOMH_VOLTAGE       = 0xBE,

    SET_CONTRAST_CURRENT    = 0xC1,
    SET_MASTER_CURRENT      = 0xC7,
    SET_MUX_RATIO           = 0xCA,

    SET_COMMAND_LOCK    = 0xFD
};

enum ssd1351_graphic_acceleration_command_table {
    HORIZONTAL_SCROLLING_SETUP  = 0x96,
    DEACTIVATE_SCROLLING        = 0x9E,
    ACTIVATE_SCROLLING          = 0x9F
};

static void ssd1351_write_byte(unsigned char chData, unsigned char chCmd)
{
	if (chCmd == SSD1351_DATA) {
	 	SSD1351_DC_SET();
	} else {
	 	SSD1351_DC_CLR();
	}

    SSD1351_CS_CLR();
	SSD1351_WRITE_BYTE(chData);
    SSD1351_CS_SET();
}

void ssd1351_draw_point(unsigned char chXpos, unsigned char chYpos, unsigned int hwColor)
{
	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    ssd1351_write_byte(hwColor >> 8, SSD1351_DATA);
    ssd1351_write_byte(hwColor, SSD1351_DATA);
}

void ssd1351_draw_line(unsigned char chXpos0, unsigned char chYpos0, unsigned char chXpos1, unsigned char chYpos1, unsigned int hwColor)
{
	int x = chXpos1 - chXpos0;
    int y = chYpos1 - chYpos0;
    int dx = abs(x), sx = chXpos0 < chXpos1 ? 1 : -1;
    int dy = -abs(y), sy = chYpos0 < chYpos1 ? 1 : -1;
    int err = dx + dy, e2;

	if (chXpos0 >= SSD1351_WIDTH || chYpos0 >= SSD1351_HEIGHT || chXpos1 >= SSD1351_WIDTH || chYpos1 >= SSD1351_HEIGHT) {
		return;
	}
    
    for (;;){
        ssd1351_draw_point(chXpos0, chYpos0 , hwColor);
        e2 = 2 * err;
        if (e2 >= dy) {     
            if (chXpos0 == chXpos1) break;
            err += dy; chXpos0 += sx;
        }
        if (e2 <= dx) {
            if (chYpos0 == chYpos1) break;
            err += dx; chYpos0 += sy;
        }
    }
}

void ssd1351_draw_h_line(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned int hwColor)
{
    unsigned int i, x1 = min(chXpos + chWidth, SSD1351_WIDTH- 1);

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos + x1 -1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < x1; i++) {
        ssd1351_write_byte(hwColor >> 8, SSD1351_DATA);
        ssd1351_write_byte(hwColor, SSD1351_DATA);
    }
}

void ssd1351_draw_v_line(unsigned char chXpos, unsigned char chYpos, unsigned char chHeight, unsigned int hwColor)
{	
	unsigned int i, y1 = min(chYpos + chHeight, SSD1351_HEIGHT - 1);

	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}
	
    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos + y1 - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < y1; i++) {
        ssd1351_write_byte(hwColor >> 8, SSD1351_DATA);
        ssd1351_write_byte(hwColor, SSD1351_DATA);
    }
}

#pragma CODE_SECTION(ssd1351_draw_column, ".TI.ramfunc")
void ssd1351_draw_column(unsigned char chXpos, unsigned char chYpos, unsigned char chHeight, unsigned int hwColor0, unsigned int hwColor1)
{
    unsigned int i;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_WIDTH || chYpos+chHeight >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_HEIGHT - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = chYpos; i < chYpos+chHeight; i++) {
        ssd1351_write_byte(hwColor0 >> 8, SSD1351_DATA);
        ssd1351_write_byte(hwColor0, SSD1351_DATA);
    }
    for (i = chYpos+chHeight; i < SSD1351_HEIGHT; i++) {
        ssd1351_write_byte(hwColor1 >> 8, SSD1351_DATA);
        ssd1351_write_byte(hwColor1, SSD1351_DATA);
    }
}

void ssd1351_draw_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight, unsigned int hwColor)
{
	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}

	ssd1351_draw_h_line(chXpos, chYpos, chWidth, hwColor);
	ssd1351_draw_h_line(chXpos, chYpos + chHeight, chWidth, hwColor);
	ssd1351_draw_v_line(chXpos, chYpos, chHeight, hwColor);
	ssd1351_draw_v_line(chXpos + chWidth, chYpos, chHeight + 1, hwColor);
}

void ssd1351_draw_circle(unsigned char chXpos, unsigned char chYpos, unsigned char chRadius, unsigned int hwColor)
{
    int x = -chRadius, y = 0, err = 2 - 2 * chRadius, e2;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    do {
        ssd1351_draw_point(chXpos - x, chYpos + y, hwColor);
        ssd1351_draw_point(chXpos + x, chYpos + y, hwColor);
        ssd1351_draw_point(chXpos + x, chYpos - y, hwColor);
        ssd1351_draw_point(chXpos - x, chYpos - y, hwColor);
        e2 = err;
        if (e2 <= y) {
            err += ++y * 2 + 1;
            if(-x == y && e2 <= x) e2 = 0;
        }
        if(e2 > x) err += ++x * 2 + 1;
    } while(x <= 0);
}

void ssd1351_draw_mono_bitmap(unsigned char chXpos, unsigned char chYpos, const unsigned char *pchBmp, unsigned char chWidth, unsigned char chHeight, unsigned int hwForeColor, unsigned int hwBackColor)
{
    unsigned char i, j, byteWidth = (chWidth + 7) / 8;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos + chWidth - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos + chHeight - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            if(*(pchBmp + j * byteWidth + i / 8) & (128 >> (i & 7))) {
                ssd1351_write_byte(hwForeColor >> 8, SSD1351_DATA);
                ssd1351_write_byte(hwForeColor, SSD1351_DATA);
            }
            else {
                ssd1351_write_byte(hwBackColor >> 8, SSD1351_DATA);
                ssd1351_write_byte(hwBackColor, SSD1351_DATA);
            }
        }
    }
}

void ssd1351_draw_64k_bitmap(unsigned char chXpos, unsigned char chYpos, const unsigned char *pchBmp, unsigned char chWidth, unsigned char chHeight)
{
    unsigned char i, j;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos + chWidth - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos + chHeight - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            ssd1351_write_byte(*pchBmp++, SSD1351_DATA);
            ssd1351_write_byte(*pchBmp++, SSD1351_DATA);
        }
    }
}

