ART-J/msp432p401r_nosdk_red/src/devicelib/ssd1351.c
void ssd1351_fill_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight, unsigned int hwColor)
{
    unsigned int i, j;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos + chWidth - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos + chHeight - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            ssd1351_write_byte(hwColor >> 8, SSD1351_DATA);
            ssd1351_write_byte(hwColor, SSD1351_DATA);
        }
    }
}

void ssd1351_fill_gram(unsigned int hwColor)
{
    unsigned char i, j;

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_WIDTH - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_HEIGHT - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < SSD1351_HEIGHT; i ++) {
        for (j = 0; j < SSD1351_WIDTH; j ++) {
            ssd1351_write_byte(hwColor >> 8, SSD1351_DATA);
            ssd1351_write_byte(hwColor, SSD1351_DATA);
        }
    }
}

void ssd1351_clear_rect(unsigned char chXpos, unsigned char chYpos, unsigned char chWidth, unsigned char chHeight)
{
    unsigned int i, j;

    if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
        return;
    }

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chXpos, SSD1351_DATA);
    ssd1351_write_byte(chXpos + chWidth - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chYpos + chHeight - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < chHeight; i++) {
        for (j = 0; j < chWidth; j++) {
            ssd1351_write_byte(0x00, SSD1351_DATA);
            ssd1351_write_byte(0x00, SSD1351_DATA);
        }
    }
}

void ssd1351_clear_gram(void)
{
    unsigned char i, j;

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_WIDTH - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_HEIGHT - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i = 0; i < SSD1351_HEIGHT; i++) {
        for (j = 0; j < SSD1351_WIDTH; j++) {
            ssd1351_write_byte(0x00, SSD1351_DATA);
            ssd1351_write_byte(0x00, SSD1351_DATA);
        }
    }
}

void ssd1351_display_char(unsigned char chXpos, unsigned char chYpos, unsigned char chChr, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{      	
	unsigned char i, j;
	unsigned char chTemp, chYpos0 = chYpos;

	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}

    for (i = 0; i < fonts_width[chFontIndex] * ((fonts_height[chFontIndex] + 7) / 8); i++) {
        switch (chFontIndex) {
            case FONT_1206:
                chTemp = c_chFont1206[chChr - ' '][i];
                break;
            case FONT_1608:
                chTemp = c_chFont1608[chChr - ' '][i];
                break;
            case FONT_1616:
                chTemp = c_chFont1616[chChr - ' '][i];
                break;
            case FONT_3216:
                chTemp = c_chFont3216[chChr - ' '][i];
                break;
            default:
                chTemp = 0x00;
                break;
        }
		
        for (j = 0; j < 8; j++) {
    		if (chTemp & 0x80) {
				ssd1351_draw_point(chXpos, chYpos, hwForeColor);
    		}
    		else {
    		    ssd1351_draw_point(chXpos, chYpos, hwBackColor);
    		}
			chTemp <<= 1;
            chYpos++;

            if ((chYpos - chYpos0) == fonts_height[chFontIndex]) {
                chYpos = chYpos0;
                chXpos++;
                break;
            }
		}
    } 
}

static unsigned long _pow(unsigned char m, unsigned char n)
{
	unsigned long result = 1;
	
	while(n --) result *= m;    
	return result;
}

void ssd1351_display_num(unsigned char chXpos, unsigned char chYpos, unsigned long chNum, unsigned char chLen, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{         	
	unsigned char i;
	unsigned char chTemp, chShow = 0;

	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}
	
	for(i = 0; i < chLen; i++) {
		chTemp = (chNum / _pow(10, chLen - i - 1)) % 10;
		if(chShow == 0 && i < (chLen - 1)) {
			if(chTemp == 0) {
				ssd1351_display_char(chXpos + fonts_width[chFontIndex] * i, chYpos, ' ', chFontIndex, hwForeColor, hwBackColor);
				continue;
			} else {
				chShow = 1;
			}	 
		}
	 	ssd1351_display_char(chXpos + fonts_width[chFontIndex] * i, chYpos, chTemp + '0', chFontIndex, hwForeColor, hwBackColor);
	}
} 

void ssd1351_display_string(unsigned char chXpos, unsigned char chYpos, const char *pchString, unsigned char chFontIndex, unsigned int hwForeColor, unsigned int hwBackColor)
{
	if (chXpos >= SSD1351_WIDTH || chYpos >= SSD1351_HEIGHT) {
		return;
	}
	
    while (*pchString != '\0') {       
        if (chXpos > (SSD1351_WIDTH - fonts_width[chFontIndex])) {
			chXpos = 0;
			chYpos += fonts_height[chFontIndex];
			if (chYpos > (SSD1351_HEIGHT - fonts_height[chFontIndex])) {
				chYpos = chXpos = 0;
				ssd1351_clear_gram();
			}
		}
		
        ssd1351_display_char(chXpos, chYpos, *pchString, chFontIndex, hwForeColor, hwBackColor);
        chXpos += fonts_width[chFontIndex];
        pchString++;
    } 
}

void ssd1351_horizontal_scrolling(unsigned char chYpos, unsigned char chHeight, unsigned char chDirection, unsigned char chInterval)
{
    if (chYpos >= SSD1351_WIDTH || (chYpos+chHeight) >= SSD1351_WIDTH) {
        return;
    }

    ssd1351_write_byte(HORIZONTAL_SCROLLING_SETUP, SSD1351_CMD);
    ssd1351_write_byte(chDirection, SSD1351_DATA);
    ssd1351_write_byte(chYpos, SSD1351_DATA);
    ssd1351_write_byte(chHeight, SSD1351_DATA);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(chInterval, SSD1351_DATA);

