ART-J/msp432p401r_nosdk_red/src/devicelib/ssd1351.c
    ssd1351_write_byte(ACTIVATE_SCROLLING, SSD1351_CMD);
}

void ssd1351_deactivate_scrolling(void)
{
    ssd1351_write_byte(DEACTIVATE_SCROLLING, SSD1351_CMD);
}

void ssd1351_show_checkerboard(void)
{
    unsigned char i,j;

    ssd1351_write_byte(SET_COLUMN_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_WIDTH - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_ROW_ADDRESS, SSD1351_CMD);
    ssd1351_write_byte(0x00, SSD1351_DATA);
    ssd1351_write_byte(SSD1351_HEIGHT - 1, SSD1351_DATA);

    ssd1351_write_byte(SET_WRITE_RAM, SSD1351_CMD);
    for (i=0; i<SSD1351_HEIGHT/2; i++) {
        for (j=0; j<SSD1351_WIDTH/2; j++) {
            ssd1351_write_byte(0xFF, SSD1351_DATA);
            ssd1351_write_byte(0xFF, SSD1351_DATA);
            ssd1351_write_byte(0x00, SSD1351_DATA);
            ssd1351_write_byte(0x00, SSD1351_DATA);
        }
        for (j=0; j<SSD1351_WIDTH/2; j++) {
            ssd1351_write_byte(0x00, SSD1351_DATA);
            ssd1351_write_byte(0x00, SSD1351_DATA);
            ssd1351_write_byte(0xFF, SSD1351_DATA);
            ssd1351_write_byte(0xFF, SSD1351_DATA);
        }
    }
}

void ssd1351_show_rainbow(void)
{
    // White => Column 0~15
    ssd1351_fill_rect(0x00, 0x00, 0x10, SSD1351_HEIGHT, White);

    // Yellow => Column 16~31
    ssd1351_fill_rect(0x10, 0x00, 0x10, SSD1351_HEIGHT, Yellow);

    // Purple => Column 32~47
    ssd1351_fill_rect(0x20, 0x00, 0x10, SSD1351_HEIGHT, Magenta);

    // Cyan => Column 48~63
    ssd1351_fill_rect(0x30, 0x00, 0x10, SSD1351_HEIGHT, Cyan);

    // Red => Column 64~79
    ssd1351_fill_rect(0x40, 0x00, 0x10, SSD1351_HEIGHT, Red);

    // Green => Column 80~95
    ssd1351_fill_rect(0x50, 0x00, 0x10, SSD1351_HEIGHT, Lime);

    // Blue => Column 96~111
    ssd1351_fill_rect(0x60, 0x00, 0x10, SSD1351_HEIGHT, Blue);

    // Black => Column 112~127
    ssd1351_fill_rect(0x70, 0x00, 0x10, SSD1351_HEIGHT, Black);
}

static inline void ssd1351_set_gray_scale_table(void)
{
	ssd1351_write_byte(SET_GRAY_SCALE_TABLE, SSD1351_CMD);  // Set Pulse Width for Gray Scale Table
	ssd1351_write_byte(0x02, SSD1351_DATA);			        // Gray Scale Level 1
	ssd1351_write_byte(0x03, SSD1351_DATA);			        // Gray Scale Level 2
	ssd1351_write_byte(0x04, SSD1351_DATA);			        // Gray Scale Level 3
	ssd1351_write_byte(0x05, SSD1351_DATA);			        // Gray Scale Level 4
	ssd1351_write_byte(0x06, SSD1351_DATA);			        // Gray Scale Level 5
	ssd1351_write_byte(0x07, SSD1351_DATA);			        // Gray Scale Level 6
	ssd1351_write_byte(0x08, SSD1351_DATA);			        // Gray Scale Level 7
	ssd1351_write_byte(0x09, SSD1351_DATA);			        // Gray Scale Level 8
	ssd1351_write_byte(0x0A, SSD1351_DATA);			        // Gray Scale Level 9
	ssd1351_write_byte(0x0B, SSD1351_DATA);			        // Gray Scale Level 10
	ssd1351_write_byte(0x0C, SSD1351_DATA);			        // Gray Scale Level 11
	ssd1351_write_byte(0x0D, SSD1351_DATA);			        // Gray Scale Level 12
	ssd1351_write_byte(0x0E, SSD1351_DATA);			        // Gray Scale Level 13
	ssd1351_write_byte(0x0F, SSD1351_DATA);			        // Gray Scale Level 14
	ssd1351_write_byte(0x10, SSD1351_DATA);			        // Gray Scale Level 15
	ssd1351_write_byte(0x11, SSD1351_DATA);			        // Gray Scale Level 16
	ssd1351_write_byte(0x12, SSD1351_DATA);			        // Gray Scale Level 17
	ssd1351_write_byte(0x13, SSD1351_DATA);			        // Gray Scale Level 18
	ssd1351_write_byte(0x15, SSD1351_DATA);			        // Gray Scale Level 19
	ssd1351_write_byte(0x17, SSD1351_DATA);			        // Gray Scale Level 20
	ssd1351_write_byte(0x19, SSD1351_DATA);			        // Gray Scale Level 21
	ssd1351_write_byte(0x1B, SSD1351_DATA);			        // Gray Scale Level 22
	ssd1351_write_byte(0x1D, SSD1351_DATA);			        // Gray Scale Level 23
	ssd1351_write_byte(0x1F, SSD1351_DATA);			        // Gray Scale Level 24
	ssd1351_write_byte(0x21, SSD1351_DATA);			        // Gray Scale Level 25
	ssd1351_write_byte(0x23, SSD1351_DATA);			        // Gray Scale Level 26
	ssd1351_write_byte(0x25, SSD1351_DATA);			        // Gray Scale Level 27
	ssd1351_write_byte(0x27, SSD1351_DATA);			        // Gray Scale Level 28
	ssd1351_write_byte(0x2A, SSD1351_DATA);			        // Gray Scale Level 29
	ssd1351_write_byte(0x2D, SSD1351_DATA);			        // Gray Scale Level 30
	ssd1351_write_byte(0x30, SSD1351_DATA);			        // Gray Scale Level 31
	ssd1351_write_byte(0x33, SSD1351_DATA);			        // Gray Scale Level 32
	ssd1351_write_byte(0x36, SSD1351_DATA);			        // Gray Scale Level 33
	ssd1351_write_byte(0x39, SSD1351_DATA);			        // Gray Scale Level 34
	ssd1351_write_byte(0x3C, SSD1351_DATA);			        // Gray Scale Level 35
	ssd1351_write_byte(0x3F, SSD1351_DATA);			        // Gray Scale Level 36
	ssd1351_write_byte(0x42, SSD1351_DATA);			        // Gray Scale Level 37
	ssd1351_write_byte(0x45, SSD1351_DATA);			        // Gray Scale Level 38
	ssd1351_write_byte(0x48, SSD1351_DATA);			        // Gray Scale Level 39
	ssd1351_write_byte(0x4C, SSD1351_DATA);			        // Gray Scale Level 40
	ssd1351_write_byte(0x50, SSD1351_DATA);			        // Gray Scale Level 41
	ssd1351_write_byte(0x54, SSD1351_DATA);			        // Gray Scale Level 42
	ssd1351_write_byte(0x58, SSD1351_DATA);			        // Gray Scale Level 43
	ssd1351_write_byte(0x5C, SSD1351_DATA);			        // Gray Scale Level 44
	ssd1351_write_byte(0x60, SSD1351_DATA);			        // Gray Scale Level 45
	ssd1351_write_byte(0x64, SSD1351_DATA);			        // Gray Scale Level 46
	ssd1351_write_byte(0x68, SSD1351_DATA);			        // Gray Scale Level 47
	ssd1351_write_byte(0x6C, SSD1351_DATA);			        // Gray Scale Level 48
	ssd1351_write_byte(0x70, SSD1351_DATA);			        // Gray Scale Level 49
	ssd1351_write_byte(0x74, SSD1351_DATA);			        // Gray Scale Level 50
	ssd1351_write_byte(0x78, SSD1351_DATA);			        // Gray Scale Level 51
	ssd1351_write_byte(0x7D, SSD1351_DATA);			        // Gray Scale Level 52
	ssd1351_write_byte(0x82, SSD1351_DATA);			        // Gray Scale Level 53
	ssd1351_write_byte(0x87, SSD1351_DATA);			        // Gray Scale Level 54
	ssd1351_write_byte(0x8C, SSD1351_DATA);			        // Gray Scale Level 55
	ssd1351_write_byte(0x91, SSD1351_DATA);			        // Gray Scale Level 56
	ssd1351_write_byte(0x96, SSD1351_DATA);			        // Gray Scale Level 57
	ssd1351_write_byte(0x9B, SSD1351_DATA);			        // Gray Scale Level 58
	ssd1351_write_byte(0xA0, SSD1351_DATA);			        // Gray Scale Level 59
	ssd1351_write_byte(0xA5, SSD1351_DATA);			        // Gray Scale Level 60
	ssd1351_write_byte(0xAA, SSD1351_DATA);			        // Gray Scale Level 61
	ssd1351_write_byte(0xAF, SSD1351_DATA);			        // Gray Scale Level 62
	ssd1351_write_byte(0xB4, SSD1351_DATA);			        // Gray Scale Level 63
}

