ART-J/msp432p401r_nosdk_red/src/devicelib/ssd1351.c
void ssd1351_init(void)
{
	SSD1351_PIN_SET();
    SSD1351_RES_SET();

	ssd1351_write_byte(SET_COMMAND_LOCK, SSD1351_CMD);              // Set Command Lock
    ssd1351_write_byte(0x12, SSD1351_DATA);				            // Unlock Driver IC
	ssd1351_write_byte(SET_COMMAND_LOCK, SSD1351_CMD);              // Set Command Lock
    ssd1351_write_byte(0xB1, SSD1351_DATA);				            // Unlock All Commands
    
    ssd1351_write_byte(SET_SLEEP_MODE_ON, SSD1351_CMD);             // Display Off
    
	ssd1351_write_byte(SET_FRONT_CLOCK_DIV_OSC_FREQ, SSD1351_CMD);  // Set Display Clock Divider / Oscillator Frequency
    ssd1351_write_byte(0xF0, SSD1351_DATA);                         // Set Clock as 90 Frames/Sec
	ssd1351_write_byte(SET_MUX_RATIO, SSD1351_CMD);                 // Set Multiplex Ratio
    ssd1351_write_byte(0x7F, SSD1351_DATA);				            // 1/128 Duty (0x0F~0x7F)
	ssd1351_write_byte(SET_DISPLAY_OFFSET, SSD1351_CMD);            // Set Vertical Scroll by Row
    ssd1351_write_byte(0x00, SSD1351_DATA);				            // Shift Mapping RAM Counter (0x00~0x7F)
    ssd1351_write_byte(SET_DISPLAY_START_LINE, SSD1351_CMD);        // Set Vertical Scroll by RAM  
    ssd1351_write_byte(0x00, SSD1351_DATA);				            // Set Mapping RAM Display Start Line (0x00~0x7F)
	ssd1351_write_byte(SET_REMAP_COLOR_DEPTH, SSD1351_CMD);         // Set Re-Map / Color Depth
    ssd1351_write_byte(0x74, SSD1351_DATA);				            // Set Horizontal Address Increment
                                                        //  Column Address 0 Mapped to SEG0
                                                        //  Color Sequence D[15:0]=[RRRRR:GGGGGG:BBBBB]
                                                        //  Scan from COM127 to COM0
                                                        //  Enable COM Split Odd Even
                                                        //  65,536 Colors Mode (0x74)
                                                        //  * 262,144 Colors Mode (0xB4)
	ssd1351_write_byte(SET_GPIO, SSD1351_CMD);                      // General Purpose IO
    ssd1351_write_byte(0x00, SSD1351_DATA);				            // Disable GPIO Pins Input
    ssd1351_write_byte(SET_FUNCTION_SELECTION, SSD1351_CMD);        // Set Vertical Scroll by RAM  
    ssd1351_write_byte(0x01, SSD1351_DATA);				            // Enable Internal VDD Regulator
                                                        //  Select 8-bit Parallel Interface
	ssd1351_write_byte(SET_SEGMENT_LOW_VOLTAGE, SSD1351_CMD);       // Set Segment Low Voltage
    ssd1351_write_byte(0xA0, SSD1351_DATA);				            // Enable External VSL
    ssd1351_write_byte(0xB5, SSD1351_DATA);                         // Fixed
    ssd1351_write_byte(0x55, SSD1351_DATA);                         // Fixed
	ssd1351_write_byte(SET_CONTRAST_CURRENT, SSD1351_CMD);          // Set Contrast Current for Color A, B, C
    ssd1351_write_byte(0xC8, SSD1351_DATA);				            // Color A
    ssd1351_write_byte(0x80, SSD1351_DATA);                         // Color B
    ssd1351_write_byte(0xC8, SSD1351_DATA);                         // Color C
	ssd1351_write_byte(SET_MASTER_CURRENT, SSD1351_CMD);            // Master Contrast Current Control
    ssd1351_write_byte(0x0F, SSD1351_DATA);				            // Maximum
    
    ssd1351_write_byte(SET_BUILTIN_LINEAR_LUT, SSD1351_CMD);        // Default
    ssd1351_set_gray_scale_table();                                 // Set Pulse Width for Gray Scale Table
	
	ssd1351_write_byte(SET_RESET_PRECHARGE_PERIOD, SSD1351_CMD);    // Phase 1 (Reset) & Phase 2 (Pre-Charge) Period Adjustment
    ssd1351_write_byte(0x32, SSD1351_DATA);				            // Set Phase 1 as 5 Clocks & Phase 2 as 3 Clocks
	ssd1351_write_byte(SET_PRECHARGE_VOLTAGE, SSD1351_CMD);         // Set Pre-Charge Voltage Level
    ssd1351_write_byte(0x17, SSD1351_DATA);				            // Set Pre-Charge Voltage Level as 0.50*VCC
	ssd1351_write_byte(SET_DISPLAY_ENHANCEMENT, SSD1351_CMD);       // Display Enhancement
    ssd1351_write_byte(0xA4, SSD1351_DATA);				            // Enhance Display Performance
    ssd1351_write_byte(0x00, SSD1351_DATA);				            // Fixed
    ssd1351_write_byte(0x00, SSD1351_DATA);				            // Fixed
	ssd1351_write_byte(SET_SECOND_PRECHARGE_PERIOD, SSD1351_CMD);   // Set Second Pre-Charge Period
    ssd1351_write_byte(0x01, SSD1351_DATA);				            // Set Second Pre-Charge Period as 1 Clock
	ssd1351_write_byte(SET_VCOMH_VOLTAGE, SSD1351_CMD);             // Set COM Deselect Voltage Level
    ssd1351_write_byte(0x05, SSD1351_DATA);				            // Set Common Pins Deselect Voltage Level as 0.82*VCC
    ssd1351_write_byte(SET_NORMAL_DISPLAY, SSD1351_CMD);            // Normal Display Mode
    
    ssd1351_clear_gram();

    ssd1351_write_byte(SET_SLEEP_MODE_OFF, SSD1351_CMD);            // Display On
}
